microchannelSimulation/0.orig/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0/air";
    object p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions  [1 - 1 - 2 0 0 0 0];

internalField uniform 0;

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type fixedFluxPressure;
        value $internalField;
    }
    outlet
    {
        type fixedValue;
        value $internalField;
    }
}

// ************************************************************************* //
