microchannelSimulation/0.orig/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0/solid";
    object p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions  [1 - 1 - 2 0 0 0 0];

internalField uniform 0;

boundaryField
{
#includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type calculated;
        value $internalField;
    }
}

// ************************************************************************* //
