microchannelSimulation/system/air/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile {
    version 2.0;
    format ascii;
    arch "LSB;label=32;scalar=64";
    class dictionary;
    location "system/air";
    object fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers {
    rho {
        solver PCG;
        preconditioner DIC;
        tolerance 1e-7;
        relTol 0.1;
    }

    rhoFinal {
        $rho;
        tolerance 1e-7;
        relTol 0;
    }

    p_rgh {
        solver GAMG;
        tolerance 1e-7;
        relTol 0.01;
        smoother GaussSeidel;
    }

    p_rghFinal {
        $p_rgh;
        tolerance 1e-7;
        relTol 0;
    }

    "(U|h|k|epsilon|R|Yi)"

        {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-7;
        relTol 0.1;
    }

    "(U|h|k|epsilon|R|Yi)Final"

        {
        $U;
        tolerance 1e-7;
        relTol 0;
    }
}

PIMPLE {
    momentumPredictor yes;
    consistent true;
    nCorrectors 5;
    nNonOrthogonalCorrectors 1;
    pRefCell    0;
    pRefValue    0;
}

relaxationFactors {
    equations {
        "h.*" 1;
        "U.*" 1;
    }
}



// ************************************************************************* //